cf/Documents/ReceiptCR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ReceiptCR</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CashInCashRegisters</xr:Item>
				<xr:Item>AccumulationRegister.Sales</xr:Item>
				<xr:Item>AccumulationRegister.SalesByDiscountCards</xr:Item>
				<xr:Item>AccumulationRegister.InventoryInWarehouses</xr:Item>
				<xr:Item>AccountingRegister.Managerial</xr:Item>
				<xr:Item>AccumulationRegister.AutomaticDiscountsApplied</xr:Item>
				<xr:Item>AccumulationRegister.IncomeAndExpenses</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Archival</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PriceKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PriceKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashCR</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CashRegisters</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashCRSession</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.RetailReport</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncludeVATInPrice</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReceiptCRNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashReceived</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ReceiptCRStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentForm</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CashAssetTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATTaxation</Name>
					<Type>
						<v8:Type>cfg:EnumRef.VATTaxationTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AmountIncludesVAT</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>POSTerminal</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.POSTerminals</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountMarkupKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.MarkupAndDiscountKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountCard</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountCards</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountPercentByDiscountCard</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountsAreCalculated</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Inventory</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ProductsAndServices</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Characteristic</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServicesCharacteristics</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Batch</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServicesBatches</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MeasurementUnit</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.UOMClassifier</v8:Type>
								<v8:Type>cfg:CatalogRef.UOM</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DiscountMarkupPercent</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VATRate</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VATAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Total</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AutomaticDiscountsPercent</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AutomaticDiscountAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ConnectionKey</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>PaymentWithPaymentCards</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ChargeCardKind</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ChargeCardNo</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>24</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>RefNo</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ETReceiptNo</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>DiscountsMarkups</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ConnectionKey</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DiscountMarkup</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AutomaticDiscounts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/ReceiptCR/Forms/FormEnterQuantity/Ext/Form/Module.bsl
#Region ProceduresFormEventsHandlers

// Procedure - event handler OnCreateAtServer of the form.
//
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	SymbolsCountAfterComma = 3;
	
	Quantity = Parameters.Quantity;
	Price = Parameters.Price;
	Amount = Parameters.Amount;
	DiscountMarkupPercent = Parameters.DiscountMarkupPercent;
	AutomaticDiscountsPercent = Parameters.AutomaticDiscountsPercent;
	ProductsAndServicesCharacteristicAndBatch = Parameters.ProductsAndServicesCharacteristicAndBatch;
	
	// Key combination setting
	For Ct = 0 To 9 Do
		Items["Button"+Ct].Shortcut = New Shortcut(Key["Num"+Ct]);
	EndDo;
	Items.DelimiterFractionalParts.Shortcut = New Shortcut(Key.NumDecimal);
	Items.Reset.Shortcut = New Shortcut(Key.BackSpace);
	
EndProcedure

#EndRegion

#Region ProceduresElementFormEventsHandlers

// Procedure - event handler OnChange item Quantity form.
//
&AtClient
Procedure QuantityOnChange(Item)
	
	AmountWithoutDiscount = Price * Quantity;
	
	// Discounts.
	If AmountWithoutDiscount <> 0 Then
		If DiscountMarkupPercent = 100 Then
			AmountAfterManualDiscountsMarkupsApplication = 0;
		ElsIf DiscountMarkupPercent <> 0 AND Quantity <> 0 Then
			AmountAfterManualDiscountsMarkupsApplication = AmountWithoutDiscount * (1 - (DiscountMarkupPercent) / 100);
		Else
			AmountAfterManualDiscountsMarkupsApplication = AmountWithoutDiscount;
		EndIf;
	Else
		AmountAfterManualDiscountsMarkupsApplication = AmountWithoutDiscount;
	EndIf;
	
	ManualDiscountAmount = AmountWithoutDiscount - AmountAfterManualDiscountsMarkupsApplication;
	
	If AutomaticDiscountsPercent <> 0 Then
		AutomaticDiscountAmount = AmountWithoutDiscount * AutomaticDiscountsPercent / 100;
	Else
		AutomaticDiscountAmount = 0;
	EndIf;
	DiscountAmount = AutomaticDiscountAmount + ManualDiscountAmount;
	
	Amount = AmountWithoutDiscount - ?(DiscountAmount > AmountWithoutDiscount, AmountWithoutDiscount, DiscountAmount);
	
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

// Procedure adds the digit right from the entered number. Fractional part divider existence is considered.
//
&AtClient
Procedure AddDigit(EnteredDigitByString)
	
	If FirstEntry Then
		EnteredNumber = "";
		FirstEntry = False;
	EndIf;
	
	Comma = Mid(EnteredNumber, StrLen(EnteredNumber) - SymbolsCountAfterComma, 1);
	
	If Not Comma = "," Then
		EnteredNumber = EnteredNumber + EnteredDigitByString;
	EndIf;
	
	Quantity = LeadStringToNumber(EnteredNumber, True);
	QuantityOnChange(Items.Quantity);
	
EndProcedure

//function executes string reduction
// to number Parameters:
//  NumberByString           - String - String provided
//  to number ReturnUndefined - Boolean - If True and string contains incorrect value that return Undefined
//
// Returns:
//  Number
//
&AtClient
Function LeadStringToNumber(NumberByString, ReturnUndefined = False)
	
	NumberTypeDescription = New TypeDescription("Number");
	NumberValue = NumberTypeDescription.AdjustValue(NumberByString);
	
	If ReturnUndefined AND (NumberValue = 0) Then
		
		Str = String(NumberByString);
		If Str = "" Then
			Return Undefined;
		EndIf;
		
		Str = StrReplace(TrimAll(Str), "0", "");
		If (Str <> "") AND (Str <> ".") AND (Str <> ",") Then
			Return Undefined;
		EndIf;
	EndIf;
	
	Return NumberValue;
	
EndFunction

#EndRegion

#Region FormCommandsHandlers

#Region Calculator

// Procedure - command handler FractionalPartDevider form.
//
&AtClient
Procedure CommandPoint(Command)
	
	If FirstEntry Then
		EnteredNumber = "";
		CurFirstEntry = False;
	EndIf;
	
	If EnteredNumber = "" Then
		EnteredNumber = "0";
	EndIf;
	
	OccurrenceCount = StrOccurrenceCount(EnteredNumber, ",");
	
	If Not OccurrenceCount > 0 Then
		EnteredNumber = EnteredNumber + ",";
	EndIf;
	
EndProcedure

// Procedure - command handler Reset forms.
//
&AtClient
Procedure CommandClear(Command)
	
	EnteredNumber = "";
	FirstEntry = False;
	Quantity = 0;
	QuantityOnChange(Items.Quantity);
	
EndProcedure

// Procedure - command handler Button1 form.
//
&AtClient
Procedure Button1(Command)
	
	AddDigit("1");
	
EndProcedure

// Procedure - command handler Button2 form.
//
&AtClient
Procedure Button2(Command)
	
	AddDigit("2");
	
EndProcedure

// Procedure - command handler Button3 form.
//
&AtClient
Procedure Button3(Command)
	
	AddDigit("3");
	
EndProcedure

// Procedure - command handler Button4 form.
//
&AtClient
Procedure Button4(Command)
	
	AddDigit("4");
	
EndProcedure

// Procedure - command handler Button5 form.
//
&AtClient
Procedure Button5(Command)
	
	AddDigit("5");
	
EndProcedure

// Procedure - command handler Button6 form.
//
&AtClient
Procedure Button6(Command)
	
	AddDigit("6");
	
EndProcedure

// Procedure - command handler Button7 form.
//
&AtClient
Procedure Button7(Command)
	
	AddDigit("7");
	
EndProcedure

// Procedure - command handler Button8 form.
//
&AtClient
Procedure Button8(Command)
	
	AddDigit("8");
	
EndProcedure

// Procedure - command handler Button9 form.
//
&AtClient
Procedure Button9(Command)
	
	AddDigit("9");
	
EndProcedure

// Procedure - command handler Button0 form.
//
&AtClient
Procedure Button0(Command)
	
	AddDigit("0");
	
EndProcedure

#EndRegion

// Procedure - command handler OK form.
//
&AtClient
Procedure OK(Command)
	
	CloseParameters = New Structure("Quantity", Quantity);
	Close(CloseParameters);
	
EndProcedure

#EndRegion
